Configuration/DataProcessors/ЗагрузкаЦенИзExcel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаЦенИзExcel</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Configuration/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/Enums/ВидыЦенПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыЦенПродажи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Розничная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дисконт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/DataProcessors/ЗагрузкаЦенИзExcel/Forms/ФормаОбработки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ДатаПрайсЛиста = НачалоДня(ТекущаяДатаСеанса());
    ВидЦены = Перечисления.ВидыЦенПродажи.Розничная;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьПрайсЛист(Команда)
    Если НЕ ЗначениеЗаполнено(ДатаПрайсЛиста) Тогда
        ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите дату прайс-листа.");
        Возврат;
    КонецЕсли;
    Если НЕ ЗначениеЗаполнено(ВидЦены) Тогда
        ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите вид цены продажи.");
        Возврат;
    КонецЕсли;

    ОписаниеОповещения = Новый ОписаниеОповещения(
        "ЗагрузитьПрайсЛистПослеВыбораФайла", ЭтотОбъект);
    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Заголовок = "Выберите файл прайс-листа";
    Диалог.Фильтр = "Файлы Excel (*.xlsx,*.xls)|*.xlsx;*.xls|Все файлы (*.*)|*.*";
    Диалог.МножественныйВыбор = Ложь;
    Диалог.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПрайсЛистПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
    Если ВыбранныеФайлы = Неопределено ИЛИ ВыбранныеФайлы.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;

    Итоги = ЗагрузитьПрайсЛистНаСервере(ВыбранныеФайлы[0], ВидЦены, ДатаПрайсЛиста);

    Для Каждого ТекстОшибки Из Итоги.Ошибки Цикл
        ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
    КонецЦикла;

    ОбщегоНазначенияКлиент.СообщитьПользователю(
        СтрШаблон("Загружено цен в регистр: %1 из %2 строк файла.",
            Итоги.Записано, Итоги.Всего));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЗагрузитьПрайсЛистНаСервере(ПутьКФайлу, ВидЦены, ДатаПрайсЛиста)

    Результат = Новый Структура;
    Результат.Вставить("Всего", 0);
    Результат.Вставить("Записано", 0);
    Результат.Вставить("Ошибки", Новый Массив);

    ТабДок = Новый ТабличныйДокумент;
    Попытка
        ТабДок.Прочитать(ПутьКФайлу);
    Исключение
        Результат.Ошибки.Добавить("Не удалось прочитать файл: "
            + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
        Возврат Результат;
    КонецПопытки;

    Дата = НачалоДня(ДатаПрайсЛиста);

    НачатьТранзакцию();
    Попытка

        Для НомерСтроки = 2 По ТабДок.ВысотаТаблицы Цикл

            Наименование    = СокрЛП(ТабДок.Область(НомерСтроки, 2).Текст);
            КодНоменклатуры = СокрЛП(ТабДок.Область(НомерСтроки, 3).Текст);
            Если НЕ ЗначениеЗаполнено(Наименование) И НЕ ЗначениеЗаполнено(КодНоменклатуры) Тогда
                Продолжить;
            КонецЕсли;

            Результат.Всего = Результат.Всего + 1;

            ТекстЦены = СокрЛП(ТабДок.Область(НомерСтроки, 4).Текст);
            ТекстЦены = СтрЗаменить(ТекстЦены, Символы.НПП, "");
            ТекстЦены = СтрЗаменить(ТекстЦены, " ", "");
            ТекстЦены = СтрЗаменить(ТекстЦены, ",", ".");
            Если ЗначениеЗаполнено(ТекстЦены) Тогда
                Цена = Число(ТекстЦены);
            Иначе
                Цена = 0;
            КонецЕсли;

            Номенклатура = Справочники.Номенклатура.НайтиПоКоду(КодНоменклатуры);
            Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
                Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Наименование, Истина);
            КонецЕсли;

            Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
                Результат.Ошибки.Добавить(СтрШаблон(
                    "Строка %1: номенклатура не найдена (код ""%2"", наименование ""%3"").",
                    НомерСтроки, КодНоменклатуры, Наименование));
                Продолжить;
            КонецЕсли;

            НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
            НаборЗаписей.Отбор.Период.Установить(Дата);
            НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
            НаборЗаписей.Отбор.ВидЦены.Установить(ВидЦены);
            НаборЗаписей.Прочитать();
            НаборЗаписей.Очистить();

            Запись = НаборЗаписей.Добавить();
            Запись.Период       = Дата;
            Запись.Номенклатура = Номенклатура;
            Запись.ВидЦены      = ВидЦены;
            Запись.Цена         = Цена;
            НаборЗаписей.Записать();

            Результат.Записано = Результат.Записано + 1;

        КонецЦикла;

        ЗафиксироватьТранзакцию();

    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;

    Возврат Результат;

КонецФункции

#КонецОбласти
